Konfigurasi EIGRP
Router(config)# router eigrp ASN
Router(config-router)# network <Network ID>
Router(config-router)# no auto-summary
atau
Router(config)# router eigrp ASN
Router(config-router)# network <Network ID> <Wildcard Mask>
Router(config-router)# no auto-summary

Keterangan :
- ASN atau Auonomous System Number adalah sebuah identity dari router eigrp. 
- Router eigrp hanya dapat berkomunikasi dengan router eigrp lain apabila memilik ASN yang sama.

Keterangan :
- bisa diikuti dengan wilcard mask atau tidak
- network <Network-ID> : untuk advertise network yang terhubung langsung dengan router

contoh : EIGRP (R1)
R1(config)#router eigrp 100
R1(config-router)#network 10.10.10.0
R1(config-router)#network 172.16.1.0
R1(config-router)#network 172.16.2.0
R1(config-router)#network 192.168.1.0
R1(config-router)#no auto-summary 

agar lebih mudah menentukan network ID
cek dengan command : show ip route
R1#show ip route 
maka akan kelihatan mana yang direclty connected (C)
     10.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C       10.10.10.0/24 is directly connected, GigabitEthernet0/0/1
L       10.10.10.2/32 is directly connected, GigabitEthernet0/0/1
     172.16.0.0/16 is variably subnetted, 4 subnets, 2 masks
C       172.16.1.0/24 is directly connected, Loopback1
L       172.16.1.1/32 is directly connected, Loopback1
C       172.16.2.0/24 is directly connected, Loopback2
L       172.16.2.2/32 is directly connected, Loopback2
     192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.1.0/24 is directly connected, GigabitEthernet0/0/0
L       192.168.1.254/32 is directly connected, GigabitEthernet0/0/0

hasil 
...
...
L       172.16.2.2/32 is directly connected, Loopback2
D       172.16.3.0/24 [90/130816] via 10.10.10.1, 00:05:13, GigabitEthernet0/0/1
D       172.16.4.0/24 [90/130816] via 10.10.10.1, 00:05:13, GigabitEthernet0/0/1
     192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.1.0/24 is directly connected, GigabitEthernet0/0/0
L       192.168.1.254/32 is directly connected, GigabitEthernet0/0/0
D    192.168.2.0/24 [90/5376] via 10.10.10.1, 00:05:02, GigabitEthernet0/0/1

R1#

EIGRP (R2)
R2(config)#router eigrp 100
R2(config-router)#network 10.10.10.0
R2(config-router)#
%DUAL-5-NBRCHANGE: IP-EIGRP 100: Neighbor 10.10.10.2 (GigabitEthernet0/0/0) is up: new adjacency
(ketika mensetting network pada router maka akan langsung muncul notif IP-EIGRP neighbour)
R2(config-router)#network 172.16.3.0
R2(config-router)#network 172.16.4.0
R2(config-router)#network 192.168.2.0
R2(config-router)#no auto-summary 

untuk memastikan yang direclty connected cek dengan command : show ip route
hasil :
...
...
D       172.16.1.0/24 [90/130816] via 10.10.10.2, 00:17:54, GigabitEthernet0/0/0
D       172.16.2.0/24 [90/130816] via 10.10.10.2, 00:17:54, GigabitEthernet0/0/0
C       172.16.3.0/24 is directly connected, Loopback3
L       172.16.3.3/32 is directly connected, Loopback3
C       172.16.4.0/24 is directly connected, Loopback4
L       172.16.4.4/32 is directly connected, Loopback4
D    192.168.1.0/24 [90/5376] via 10.10.10.2, 00:17:54, GigabitEthernet0/0/0
     192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks
C       192.168.2.0/24 is directly connected, GigabitEthernet0/0/1
L       192.168.2.254/32 is directly connected, GigabitEthernet0/0/1
